export const langArr = {
    bakkatravel: {
        kz: "Өміріңіздегі ең маңызды саяхатты бізбен бірге жасаңыз!",
        ru: "Соверши самое главное путешествие в своей жизни вместе с нами!",
      },
      onas: {
        kz: "Біз туралы",
        ru: "О нас",
      },
      mekkaandmedina: {
        kz: "Мекке мен Мединаға турлар",
        ru: "Туры в Мекку и Медину",
      },
      tourst: {
        kz: "Турлар",
        ru: "Туры",
      },
      hadj: {
        kz: "Қажылық",
        ru: "Хадж",
      },
      umra: {
        kz: "Умра",
        ru: "Умра",
      },
      number_text : {
      kz : "Байланыс номері",
      ru : "Свяжитесь с нами",
  },
      choose_tour: {
        kz: "Турды таңдау",
        ru: "Выбрать тур",
      },
      options : {
      kz : "BAKKA Travel-әлемдегі мұсылмандар үшін жетекші туроператорлардың бірі.2006 жылдан бастап біз Ислам туризмін, мұсылмандар үшін қасиетті Мекке мен сәулелі Мединаға қажылықты ұйымдастырумен айналысып келеміз.",
      ru : "BAKKA Travel – один из ведущих туроператоров для мусульман по всему миру.С 2006 года мы успешно занимаемся организацией исламского туризма, паломничества для мусульман в Священную Мекку и Лучезарную Медину.",
  },
  our_advantages: {
      kz : "Біздің артықшылықтарымыз",
      ru : "Наши преимущества",
  },
  first_block_h6: {
      kz : "Исламдық білімі бар кәсіби гидтер",
      ru : "Профессиональные гиды с Исламским образованием",
  },
  first_block_p : {
      kz : "Біздің гидтер-көп жылдық тәжірибесі бар устаздар мен имамдар",
      ru : "Наши гиды - это устазы и имамы с многолетним опытом",
  },
  second_block_h6 : {
      kz : "Қасиетті жерлерге экскурсиялар",
      ru : "Экскурсии по священным местам",
  },
  second_block_p : {
      kz : "Күтім қаласы, Сафа Марва, Хира үңгірі, Пайғамбар мешіті, құрма бағы және т.б",
      ru : "Город Ухуд, Сафа-Марва, Пещера Хира, Мечеть Пророка, Финиковый сад и многое другое.",
  },
  third_block_h6 : {
      kz : "Қасиетті рәсімдерді орындауға көмектесу",
      ru : "Помощь в совершении священных обрядов",
  },
  third_block_p : {
      kz : "Біз сізге умраның барлық кезеңдерін аяқтауға көмектесеміз",
      ru : "Мы поможем вам в совершении всех этапов Умры",
  },
  fourth_block_h6 : {
      kz : "Қонақ үйлер мен тамақтану",
      ru : "Отели и питание",
  },
  fourth_block_p : {
      kz : "Мекке мен Мединадағы ең жақсы қонақ үйлер, Аль-Харам мешітіне жақын, күніне 2 рет тамақтану.",
      ru : "Лучшие отели в Мекке и Медине, ближайшие к мечети Аль-Харам, питание 2 раза в день.",
  },
  fifth_block_h6 : {
      kz : "Умра туралы егжей-тегжейлі оқыту",
      ru : "Детальное обучение к Умре",
  },
  fifth_block_p : {
      kz : "Біздің гидтер-көп жылдық тәжірибесі бар устаздар мен имамдар.",
      ru : "Наши гиды - это устазы и имамы с многолетним опытом",
  },
  sixth_block_h6 : {
      kz : "Екі жаққа да билеттер",
      ru : "Билеты в обе стороны",
  },
  sixth_block_p : {
      kz : "Медина мен Джиддаға ең ыңғайлы ұшақтарда тікелей рейстер",
      ru : "Прямые рейсы в Медину и Джидду в самых удобных самолетах",
  },
  seventh_block_h6 : {
      kz : "Әуежайда кездесу және шығарып салу",
      ru : "Встреча и проводы в аэропорту",
  },
  seventh_block_p : {
      kz : "Біздің гид сіздерді қарсы алады және бағыттайды",
      ru : "Наш гид встретит и проводит вас",
  },
  eighth_block_h6 : {
      kz : "Қонақ үйлер мен тамақтану",
      ru : "Отели и питание",
  },
  eighth_block_p : {
      kz : "1 жыл мерзімге визаны ресімде",
      ru : "Оформление тур визы сроком на 1 год",
  },
  our_tours_text : {
      kz : "Біздің турлар",
      ru : "Наши туры",
  },
  umra_text : {
      kz : "Умра",
      ru : "Умра",
  },
  umra_options : {
      kz : "Кіші қажылық",
      ru : "Малое паломничество",
  },
  details1 : {
      kz : "Толығырақ",
      ru : "Подробнее",
  },
  hadj_text : {
      kz : "Қажылық",
      ru : "Хадж",
  },
  hadj_options : {
      kz : "Үлкен қажылық",
      ru : "Большое паломничество",
  },
  details2 : {
      kz : "Толығырақ",
      ru : "Подробнее",
  },
  hot_tours : {
      kz : "Ең тиімді турлар",
      ru : "Горящие туры",
  },
  hot_tours_options : {
      kz : "2024 жылға арналған Мекке мен Мединаға саяхаттауға арналған ең жақсы мәмілелер",
      ru : "Самые выгодные предложения для путешествия  в Мекку и Медину на 2024 год",
  },
  details3 : {
      kz : "Барлық ұсыныстарды қараңыз",
      ru : "Смотреть все предложения",
  },
  paket_tours_text : {
      kz : "Турлар пакеті",
      ru : "Пакет туров",
  },
  duration1 : {
      kz : "Ұзақтығы",
      ru : "Длительность",
  },
  duration2 : {
      kz : "Ұзақтығы",
      ru : "Длительность",
  },
  duration3 : {
      kz : "Ұзақтығы",
      ru : "Длительность",
  },
  duration1_option : {
      kz : "11 күн",
      ru : "11 дней",
  },
  way1 : {
      kz : "Бағыт",
      ru : "Направление",
  },
  way2 : {
      kz : "Бағыт",
      ru : "Направление",
  },
  way3 : {
      kz : "Бағыт",
      ru : "Направление",
  },
  al_haram1 : {
      kz : "Әл-Харам мешітіне дейін",
      ru : "До мечети Аль-Харам",
  },
  al_haram2 : {
      kz : "Әл-Харам мешітіне дейін",
      ru : "До мечети Аль-Харам",
  },
  al_haram3 : {
      kz : "Әл-Харам мешітіне дейін",
      ru : "До мечети Аль-Харам",
  },
  food1 : {
      kz : "Тамақтану",
      ru : "Питания",
  },
  food2 : {
      kz : "Тамақтану",
      ru : "Питания",
  },
  food3 : {
      kz : "Тамақтану",
      ru : "Питания",
  },
  hotel1 : {
      kz : "Қонақ үй",
      ru : "Отель",
  },
  hotel2 : {
      kz : "Қонақ үй",
      ru : "Отель",
  },
  hotel3 : {
      kz : "Қонақ үй",
      ru : "Отель",
  },
  price_text1 : {
      kz : "Бағасы:",
      ru : "Цена:",
  },
  price_text2 : {
      kz : "Бағасы:",
      ru : "Цена:",
  },
  price_text3 : {
      kz : "Бағасы:",
      ru : "Цена:",
  },
  book1 : {
      kz : "Бронь жасау",
      ru : "Забронировать",
  },
  book2 : {
      kz : "Бронь жасау",
      ru : "Забронировать",
  },
  book3 : {
      kz : "Бронь жасау",
      ru : "Забронировать",
  },
  duration1_carousel1 : {
      kz : "Ұзақтығы",
      ru : "Длительность",
  },
  duration2_carousel2 : {
      kz : "Ұзақтығы",
      ru : "Длительность",
  },
  duration3_carousel3 : {
      kz : "Ұзақтығы",
      ru : "Длительность",
  },
  duration1_option_carousel1 : {
      kz : "20 күн",
      ru : "20 дней",
  },
  duration2_option_carousel2 : {
      kz : "20 күн",
      ru : "20 дней",
  },
  duration3_option_carousel3 : {
      kz : "20 күн",
      ru : "20 дней",
  },
  way1_carousel1 : {
      kz : "Бағыт",
      ru : "Направление",
  },
  way2_carousel2 : {
      kz : "Бағыт",
      ru : "Направление",
  },
  way3_carousel3 : {
      kz : "Бағыт",
      ru : "Направление",
  },
  al_haram1_carousel1 : {
      kz : "Әл-Харам мешітіне дейін",
      ru : "До мечети Аль-Харам",
  },
  al_haram2_carousel2 : {
      kz : "Әл-Харам мешітіне дейін",
      ru : "До мечети Аль-Харам",
  },
  al_haram3_carousel3 : {
      kz : "Әл-Харам мешітіне дейін",
      ru : "До мечети Аль-Харам",
  },
  food1_carousel1 : {
      kz : "Тамақтану",
      ru : "Питания",
  },
  food2_carousel2 : {
      kz : "Тамақтану",
      ru : "Питания",
  },
  food3_carousel3 : {
      kz : "Тамақтану",
      ru : "Питания",
  },
  hotel1_carousel1 : {
      kz : "Қонақ үй",
      ru : "Отель",
  },
  hotel2_carousel2 : {
      kz : "Қонақ үй",
      ru : "Отель",
  },
  hotel3_carousel3 : {
      kz : "Қонақ үй",
      ru : "Отель",
  },
  price_text1_carousel1 : {
      kz : "Бағасы:",
      ru : "Цена:",
  },
  price_text2_carousel2 : {
      kz : "Бағасы:",
      ru : "Цена:",
  },
  price_text3_carousel3 : {
      kz : "Бағасы:",
      ru : "Цена:",
  },
  book1_carousel1 : {
      kz : "Бронь жасау",
      ru : "Забронировать",
  },
  book2_carousel2 : {
      kz : "Бронь жасау",
      ru : "Забронировать",
  },
  book3_carousel3 : {
      kz : "Бронь жасау",
      ru : "Забронировать",
  },
  our_gids : {
      kz : "Біздің гидтер",
      ru : "Наши гиды",
  },
  our_gids_options : {
      kz : "Сіздің сапарыңыздың сәтті өтуі үшін бәрін жасайтын біздің ең жақсы мамандарды! Олар әрқашан сізбен байланыста және сізге кез келген сұраққа көмектеседі!",
      ru : "Представляем наших лучших специалистов, которые сделают все,чтобы ваша поездка прошла удачно! Они всегда с вами на связии помогут вам с любым вопросом!",
  },
  education : {
      kz : "Білімі:",
      ru : "Образование:",
  },
  languages : {
      kz : "Тілдері:",
      ru : "Языки:",
  },
  soon_in_phone : {
      kz : "Жақында сіздің телефоныңызда!",
      ru : "Скоро в твоем телефоне!",
  },
  soon_in_phone_option : {
      kz : "Біздің қосымшаның көмегімен турды таңдап, сапарға шығу одан да ыңғайлы және жылдам болады!Біздің сайтта және Instagram-да жаңалықтарды қадағалаңыз.",
      ru : "С нашим приложением подобрать тур и отправитьсяв путешествие станет еще удобнее и быстрее!Следи за новостями на нашем сайте и в инстаграм.",
  },
  follow : {
      kz : "Тіркелу",
      ru : "Подписаться",
  },
  qua_text : {
      kz : "Танымал сұрақтар мен оларға жауаптар",
      ru : "Популярные вопросы и ответы на них",
  },
  qua_text2 : {
      kz : "Танымал сұрақтар мен оларға жауаптар",
      ru : "Популярные вопросы и ответы на них",
  },
  form_text : {
      kz : "Сұрақтар қалды ма?",
      ru : "Остались вопросы?",
  },
  form_option : {
      kz : "Өтінімді қалдырыңыз, біз сізге жақын арада хабарласамыз!",
      ru : "Оставьте заявку и мы скоро свяжемся с Вами!",
  },
  form_option2 : {
      kz : "Жіберу батырмасын басу арқылы мен дербес деректерді өңдеуге келісім беремін",
      ru : "Нажимая на кнопку отправить, я даю согласие на обработку персональных данных",
  },
  onas2 : {
      kz : "Біз туралы",
      ru : "О нас",
  },
  paket_tours_text2 : {
      kz : "Турлар пакеті",
      ru : "Пакет туров",
  },
  tourst2 : {
      kz : "Турлар",
      ru : "Туры",
  },
  umra2 : {
      kz : "Умра",
      ru : "Умра",
  },
  hadj2 : {
      kz : "Қажылық",
      ru : "Хадж",
  },
  sviazivat : {
      kz : "Байланыс",
      ru : "Контакты",
  },
  street : {
      kz : "Азат 20А көшесі",
      ru : "Улицв Азат 20А",
  },
  form_text_boot : {
      kz : "Заявка қалдыру",
      ru : "Оставить заявку",
  },
  form_name : {
      kz : "Есіміңіз:",
      ru : "Имя:",
  },
  form_number : {
      kz : "Телефон номеріңіз:",
      ru : "Номер телефона:",
  },
  form_name_foot : {
      kz : "Есіміңіз:",
      ru : "Имя:",
  },
  form_number_foot : {
      kz : "Телефон номеріңіз:",
      ru : "Номер телефона:",
  },
  function_next : {
      kz : "Бұл мүмкіндік келесі нұсқада қолжетімді болады!",
      ru : "Это функция будет доступно в следующем версии!",
  },
  attention : {
      kz : "Ескерту",
      ru : "Примечание",
  },
  date_tour1: {
    kz: "16 қыркүйек - 26 қыркүйек 2024",
    ru: "16 сентябрь - 26 сентябрь 2024 "
  },
  date_tour2: {
    kz: "7 қазан - 17 қазан 2024",
    ru: "7 октябрь - 17 октябрь 2024 "
  },
  date_tour3: {
    kz: "28 қазан - 7 қараша 2024",
    ru: "28 октябрь - 7 ноябрь 2024 "
  },
  consultation: {
    kz: "Толығырақ",
    ru: "Подробнее"
  },
  all_places: {
    kz: "Жалпы орын: 300",
    ru: "Всего мест: 300"
  },
  places: {
    kz: "Қалған орындар: 300",
    ru: "Осталось мест: 300"
  },
  confedencial: {
    kz: "Жіберу түймесін басу арқылы мен жеке деректерді өңдеуге келісім беремін",
    ru: "Нажимая на кнопку отправить, я даю согласие на обработку персональных данных"
  },
  news_tittle: {
    kz: "Жаңалықтар",
    ru: "Новости"
  },
  all_news: {
    kz: "Барлығын көру",
    ru: "Cмотреть все"
  },
  read_news: {
    kz: "Дереккөзді оқу",
    ru: "Читать источник"
  },
  review: {
    kz: "Пікірлер",
    ru: "Отзывы"
  },
  };
  